# GetPlacementOnSheetStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetPlacementOnSheetStatus Method
View Class See Also
---
Determines if this view placed on a sheet completely or partially.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ViewPlacementOnSheetStatus GetPlacementOnSheetStatus()
```

Visual Basic
---
```text
Public Function GetPlacementOnSheetStatus As ViewPlacementOnSheetStatus
```

Visual C++
---
```text
public:
ViewPlacementOnSheetStatus GetPlacementOnSheetStatus()
```

# ### Return Value
A value indicating whether and how the View is placed on a Sheet.
# Remarks
Some Views can be placed on one or more Sheets completely or partially. For example, a Schedule divided in segments, and only some of them are placed on Sheets.
# See Also
View Class
Autodesk.Revit.DB Namespace